load-test.yaml
config:
  target: http://192.168.65.3:32313  # Use the internal IP and NodePort of your service
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase

scenarios:
  - name: Test React Service
    flow:
      - get:
          url: "/"  # Modify this to your actual endpoints if needed
      - get:
          url: "/api"  # Example endpoint for API testing, adjust as needed